var pc2 = ["#EE0026","#F9344C","#CA1028","#9E002C","#FA7482","#C95F6A","#994152","#632A31","#FBB4C4","#D7A4B6","#7D4F5B","#3A2C2E"];
var pc4 = ["#FE4118","#FC4E32","#CC4613","#A41200","#FB8072","#D77856","#B24443","#743526","#FDCDB7","#D8AFA7","#7D5F61","#3A2C2A"];
var pc6 = ["#FF7F00","#FF9914","#D9760F","#A34A02","#FDB46C","#D89048","#B25938","#6C4919","#FEE6AA","#D9BA97","#7D6764","#463B34"];
var pc8 = ["#FFE600","#FFF231","#CCB914","#A38204","#FFF27B","#CCBA48","#997F42","#695B18","#FFFFB3","#D9C69B","#7D6F59","#46402C"];
var pc10 = ["#99CF15","#99D02B","#8CA113","#518517","#B3DE69","#B3B140","#747E47","#56561A","#E6F5B0","#AAC09B","#636E5B","#3E3F31"];
var pc12 = ["#33A23D","#33A65E","#27853F","#2F6F41","#7FC97E","#66AC78","#5A804B","#345934","#CCEBC5","#9EBCA3","#486C5C","#24342D"];
var pc14 = ["#008678","#1AA18E","#297364","#025965","#66C2AE","#4E9B86","#2A6B68","#1D4B44","#B3E2D8","#91B8AC","#385B63","#253532"];
var pc16 = ["#055D87","#1D86AE","#205B85","#04436D","#67B2CA","#4F8B97","#1E6282","#0E4251","#B3D7DD","#91AFBB","#384E5D","#283539"];
var pc18 = ["#0F218B","#386CB0","#233B8B","#073E73","#679FCA","#516690","#214274","#16344F","#B3CDE3","#91A4B6","#384158","#222831"];
var pc20 = ["#281285","#6964AD","#3D1C83","#232166","#807DBA","#5D5791","#3A367B","#312C4B","#B2B6D8","#9191AD","#3F2F50","#282430"];
var pc22 = ["#56007D","#A45AAA","#5E2883","#531460","#B172B6","#8C5588","#5E3179","#4A304B","#CAB2D6","#A997B0","#493753","#2E2A31"];
var pc24 = ["#AF0065","#DF4C94","#990F4F","#740050","#E170A4","#B15076","#802A68","#633142","#E3ADD5","#C09EB3","#5A3A54","#3A2D31"];
var pcs = [pc2,pc4,pc6,pc8,pc10,pc12,pc14,pc16,pc18,pc20,pc22,pc24];

var tonename = ["Vivid","Bright","Strong","Deep","Light","Soft","Dull","Dark","Pale","LightGrayish","Grayish","DarkGrayish","White","Black"];

var toneimage = ["Vivid：鮮やか、冴えた、派手な、目立つ、生き生きした","Bright：明るい、健康的な、陽気な、華やかな","Strong：強い、くどい、動的な、情熱的な","Deep：深い、濃い、充実した、伝統的な、和風の","Light：浅い、澄んだ、子供っぽい、爽やかな、楽しい","Soft：柔らか、穏やかな、ぼんやりした","Dull：くすんだ、鈍い、中間色","Dark：暗い、大人っぽい、丈夫な、円熟した","Pale：薄い、軽い、あっさりした、弱い、女性的、若々しい、優しい、淡い、かわいい","LightGrayish：明るい灰みの、落ち着いた、渋い、おとなしい","Grayish：灰みの、濁った、地味な","DarkGrayish：暗い灰みの、陰気な、重い、硬い、男性的"];


var qual1 = [];
var qual2 = [];
var qual3 = [];
var qual4 = [];
var qual5 = [];
var qual6 = [];
var qual7 = [];
var qual8 = [];
var qual9 = [];
var qual10 = [];
var qual11 = [];
var qual12 = [];
var qual = [qual1,qual2,qual3,qual4,qual5,qual6,qual7,qual8,qual9,qual10,qual11,qual12];